nc: 80
depth_multiple: 0.33
width_multiple: 0.25
backbone:

  - [-1, 1, FastViTBackbone, [fastvit_t8, 0]]  # P2
  - [-1, 1, FastViTBackbone, [fastvit_t8, 1]]  # P3
  - [-1, 1, FastViTBackbone, [fastvit_t8, 2]]  # P4
  - [-1, 1, FastViTBackbone, [fastvit_t8, 3]]  # P5

head:

  - [0, 1, Conv, [128, 1, 1]]
  - [-1, 1, LiteTransformerBlock, [128]]

  - [1, 1, Conv, [256, 1, 1]]
  - [-1, 1, LiteTransformerBlock, [256]]

  - [2, 1, Conv, [512, 1, 1]]
  - [-1, 1, LiteTransformerBlock, [512]]

  - [3, 1, Conv, [1024, 1, 1]]

  - [[1,3,5,7], 1, Detect, [nc]]