# Parameters
nc: 7 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [1.0, 0.25, 1024]
  # YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, PatchEmbed_FasterNet, [40, 4, 4]]  # 0-P1/4
  - [-1, 1, BasicStage, [40, 1]]  # 1
  - [-1, 1, PatchMerging_FasterNet, [80, 2, 2]]  # 2-P2/8
  - [-1, 2, BasicStage, [80, 1]]  # 3-P3/16
  - [-1, 1, PatchMerging_FasterNet, [160, 2, 2]]  # 4
  - [-1, 8, BasicStage, [160, 1]]  # 5-P4/32
  - [-1, 1, PatchMerging_FasterNet, [320, 2, 2]] # 6
  - [-1, 2, BasicStage, [320, 1]] # 7
  - [-1, 1, SPPF, [320, 5]]  # 8


# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, C2f, [256]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, C2f, [128]]  # 14 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 1, C2f, [256]]  # 17 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 1, C2f, [512]]  # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)


#TRAIN 31(21/10/25) with C2f layer 123 layers, 674,149 parameters, 674,133 gradients, 2.3 GFLOPs
#TRAIN 32(21/10/25) with C3k2 layer 112 layers, 622,861 parameters, 622,845 gradients, 2.2 GFLOPs amp=True
#TRAIN 35(21/10/26) with A2C2f YOLOv8-fasternet summary: 207 layers, 568,597 parameters, 568,581 gradients, 1.9 GFLOPs amp=True
# head: #train35
#   - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#   - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
#   - [-1, 1, A2C2f, [256]]  # 11

#   - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#   - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
#   - [-1, 1, C3k2, [128]]  # 14 (P3/8-small)

#   - [-1, 1, Conv, [128, 3, 2]]
#   - [[-1, 11], 1, Concat, [1]]  # cat head P4
#   - [-1, 1, A2C2f, [256]]  # 17 (P4/16-medium)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 8], 1, Concat, [1]]  # cat head P5
#   - [-1, 1, A2C2f, [512]]  # 20 (P5/32-large)

#   - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)