# Parameters
nc: 7 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 512]


backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,         [64,  4, 4]] # 0-P2/4
  - [-1, 1, VanillaBlock, [96,  3, 2]]  # 1-P3/8
  - [-1, 1, VanillaBlock, [192, 3, 2]]  # 2-P4/16
  - [-1, 1, VanillaBlock, [384, 3, 2]]  # 3-P5/32
  - [-1, 1, VanillaBlock, [512, 3, 1]]  # 4-P5/32
  # - [-1, 1, SPPF, [512, 5]]  

# head: #TRAIN 34 :YOLOv8-vanillanet summary: 117 layers, 612,701 parameters, 612,685 gradients, 1.9 GFLOPs (with SPPF, AMP)
#   - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #1/16
#   - [[-1, 2], 1, Concat, [1]]  # cat backbone P4
#   - [-1, 3, C3k2, [256]]  # 7

#   - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #1/8
#   - [[-1, 1], 1, Concat, [1]]  # cat backbone P3
#   - [-1, 3, C3k2, [128]]  # 10 (P3/8-small)

#   - [-1, 1, Conv, [192, 3, 2]] #1/16
#   - [[-1, 8], 1, Concat, [1]]  # cat head P4
#   - [-1, 3, C3k2, [384]]  # 13 (P4/16-medium)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 5], 1, Concat, [1]]  # cat head P5
#   - [-1, 3, C3k2, [512]]  # 16 (P5/32-large)

#   - [[11, 14, 17], 1, Detect, [nc]]  # Detect(P3, P4, P5)

head: #TRAIN 33 : YOLOv8-vanillanet summary: 112 layers, 571,357 parameters, 571,341 gradients, 1.9 GFLOPs (without SPPF) AMP
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #1/16
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C3k2, [256]]  # 7

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #1/8
  - [[-1, 1], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C3k2, [128]]  # 10 (P3/8-small)

  - [-1, 1, Conv, [192, 3, 2]] #1/16
  - [[-1, 7], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C3k2, [384]]  # 13 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 4], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C3k2, [512]]  # 16 (P5/32-large)

  - [[10, 13, 16], 1, Detect, [nc]]  # Detect(P3, P4, P5) 