# Parameters
nc: 7  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

#TRAIN 19 : YOLOv8_DeepBiFpn summary: 162 layers, 618,603 parameters, 618,587 gradients, 2.6 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [64, True]]
  - [-1, 1, Conv, [128, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [512, True]]
  - [-1, 1, SPPF, [512, 5]]  # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10-p4/16  1024*20*20 1024*40*40
  - [[-1, 6], 1, BiFPN_Concat2, [1]]             # 11        (1024+512)*40*40
  - [-1, 3, C3k2, [128]]                          # 12        1536*40*40 512*40*40

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13-P3/8   512*40*40 512*80*80
  - [[-1, 4], 1, BiFPN_Concat2, [1]]             # 14        (512+256)*80*80
  - [-1, 3, C3k2, [128]]                          # 15        768*80*80 256*80*80

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 16-P2/4   256*80*80 256*160*160
  - [[-1, 2], 1, BiFPN_Concat2, [1]]             # 17        (256+128)*160*160
  - [-1, 3, C3k2, [128]]                          # 18        384*160*160 128*160*160

  - [-1, 1, Conv, [128, 3, 2]]                   # 19-P3/8   128*160*160 128*80*80
  - [[-1, 4, 15], 1, BiFPN_Concat3, [1]]         # 20        (128+256+256)*80*80
  - [-1, 3, C3k2, [128]]                          # 21        640*80*80 256*80*80

  - [-1, 1, Conv, [128, 3, 2]]                   # 22-P4/16  256*80*80 256*40*40
  - [[-1, 6, 12], 1, BiFPN_Concat3, [1]]         # 23        (256+512+512)*40*40
  - [-1, 3, C3k2, [128]]                          # 24        1280*40*40 512*40*40

  - [-1, 1, Conv, [128, 3, 2]]                   # 25-P5/32  512*40*40 512*20*20
  - [[-1, 9], 1, BiFPN_Concat2, [1]]             # 26        (512+1024)*20*20
  - [-1, 3, C3k2, [256]]                         # 27        1536*20*20 1024*20*20

  - [[18, 21, 24], 1, Detect, [nc]]          # Detect(P2, P3, P4, P5)
# workspace/ultralytics/ultralytics/cfg/models/v8/yolov8_DeepBiFpn.yaml

# yolo detect train model=workspace/ultralytics/ultralytics/cfg/models/v8/yolov8_DeepBiFpn.yaml data=/media/lavi/Data/datasets/check_220925/data_nguyenVC_modified.yaml epochs=200 batch=8 save=True amp=False hsv_h=0.015 hsv_s=0.7 hsv_v=0.2 degrees=5.0 translate=0.0 scale=0.1 bgr=0.1 shear=5.0 perspective=0.001 flipud=0.0 fliplr=0.5 mosaic=0.0 mixup=0.0 copy_paste=0.0 erasing=0.0 auto_augment=None resume=True