# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-cls image classification model with YOLO backbone
# Model docs: https://docs.ultralytics.com/models/yolov8

# Parameters
nc: 30 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-multi-label-cls.yaml' will call yolov8-multi-label-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]

# YOLOv8.0n backbone
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
#   - [-1, 3, C2f, [128, True]]
#   - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
#   - [-1, 6, C2f, [256, True]]
#   - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
#   - [-1, 6, C2f, [512, True]]
#   - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
#   - [-1, 3, C2f, [1024, True]]
# YOLO12n backbone
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
#   - [-1, 2, C3k2, [256, False, 0.25]]
#   - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
#   - [-1, 2, C3k2, [512, False, 0.25]]
#   - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
#   - [-1, 4, A2C2f, [512, True, 4]]
#   - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
#   - [-1, 4, A2C2f, [1024, True, 1]] # 8
# YOLO11n backbone
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
#   - [-1, 2, C3k2, [256, False, 0.25]]
#   - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
#   - [-1, 2, C3k2, [512, False, 0.25]]
#   - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
#   - [-1, 2, C3k2, [512, True]]
#   - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
#   - [-1, 2, C3k2, [1024, True]]
#   - [-1, 2, C2PSA, [1024]] # 9
# YOLOv8.0n backbone CBAM (chanel attention + spatial attention) TRAIN8
# backbone:
  # [from, repeats, module, args]
  # - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  # - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  # - [-1, 3, C2f, [128, True]]
  # - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  # - [-1, 6, C2f, [256, True]]
  # - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  # - [-1, 6, C2f, [512, True]]
  # - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  # - [-1, 3, C2f, [1024, True]]
# backbone:
  # - [-1, 1, PatchEmbed_FasterNet, [80, 4, 4]]  # 0-P1/4
  # - [-1, 1, BasicStage, [80, 1]]  # 1
  # - [-1, 1, PatchMerging_FasterNet, [160, 2, 2]]  # 2-P2/8
  # - [-1, 2, BasicStage, [160, 1]]  # 3-P3/16
  # - [-1, 1, PatchMerging_FasterNet, [320, 2, 2]]  # 4
  # - [-1, 8, BasicStage, [320, 1]]  # 5-P4/32
  # - [-1, 1, PatchMerging_FasterNet, [640, 2, 2]] # 6
  # - [-1, 2, BasicStage, [640, 1]] # 7
  # - [-1, 1, SPPF, [640, 5]]  # 8

# # YOLOv8.0n head

# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, ConvNeXt_Stem, [96, 4, 4]]  # 0-P2/4
#   - [-1, 3, ConvNeXt_Block, [96]]
#   - [-1, 1, ConvNeXt_Downsample, [192, 2, 2]] # 2-P3/8
#   - [-1, 3, ConvNeXt_Block, [192]]
#   - [-1, 1, ConvNeXt_Downsample, [384, 2, 2]] # 4-P4/16
#   - [-1, 9, ConvNeXt_Block, [384]]
#   - [-1, 1, ConvNeXt_Downsample, [768, 2, 2]] # 6-P5/32
#   - [-1, 3, ConvNeXt_Block, [768]]


#custom 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  # - [-1, 2, C3k2, [512, True]]
  - [-1, 2, C2PSA, [512]] # 9
head:
  - [-1, 1, MultiLabelClassify, [nc]] # MultiLabelClassify