# ty-lite-p5.yaml
nc: 80 
scales: 
  n: [0.33, 0.25, 1024] 

# TY-Lite Backbone with Deep P5 Integration
backbone:
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2 
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4 
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8 
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16 
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32 
  - [-1, 2, C3k2, [1024, True]]
  # Phase I & II: Strategic placement of DPFA Transformer Block at the deepest stage
  - [-1, 1, DPFATransformerBlock, [1024, 4]] # 9-P5-Hybrid
  - [-1, 1, SPPF, [1024, 5]]    # 10

# TY-Lite Head (Path Aggregation Network)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]   # cat backbone P4 (index 6 provides sharp edges)
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]   # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]