nc: 7  # number of classes
scales: 
  # [depth, width, max_channels]
  n: [1.0, 0.50, 576] 

# MBNV3 Small backbone(Change from ReLU to SiLU)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, mn_conv, [16, 3, 2, "RE"]]  
  - [-1, 1, mn_conv, [16, 1, 1, "RE"]]
  - [-1, 1, MobileNetV3_BLOCK, [16, 3, 16, False, "RE", 2, False]]   
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 96, False, "RE", 2]]  
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 96, False, "RE", 1]]
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 96, True, "RE", 2]] 
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 192, True, "RE", 1]]
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 192, True, "RE", 1]]
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 192, True, "RE", 1]]
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 192, True, "RE", 1]]
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 576, True, "RE", 2]]
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 576, True, "RE", 1]]
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 576, True, "RE", 1]]
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 576, True, "RE", 1]]
  - [-1, 1, SPPF, [96, 5]]                           
  
# MBNV3 Small head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "RE", 1]]
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "RE", 1]]
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "RE", 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 96, True, "RE", 1, False]] 
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 64, True, "RE", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 64, True, "RE", 1]] 

  - [-1, 1, mn_conv, [64, 3, 2, "RE"]]
  - [[-1, 19], 1, Concat, [1]]  # cat head P4
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "RE", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "RE", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "RE", 1]] 

  - [-1, 1, mn_conv, [96, 3, 2, "RE"]]
  - [[-1, 14], 1, Concat, [1]]  # cat head P5
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "RE", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "RE", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "RE", 1]] 

  - [[24, 29, 34], 1, Detect, [nc]]  # Detect(P3, P4, P5)
